// TASK 1- Є змінна х, якій ви надаєте довільне числове значення.
//     Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

// let x = +prompt('Введіть довільне число');
// if(x === 0){
//     console.log('Невірно');
// }
// else {
//     console.log('Вірно');
// }



// TASK 2- Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить,
// до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
// let time = +prompt('Введіть число від 0 до 59');
// if(time >=0 && time <=15)
//     console.log('Перша частина години');
// else if(time >15 && time <=30)
//     console.log('Друга частина години');
// else if(time >30 && time <=45)
//     console.log('Третя частина години');
// else if(time >45 && time <=59)
//     console.log('Четверта частина години');
// else {
//     console.log('Некоректне число')
// }


// TASK 3- У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
// let day = +prompt('Введіть число від 1 до 31');
// if(day >=1 && day <=10)
//     console.log('Перша декада місяця');
// else if(day >10 && day <=20)
//     console.log('Друга декада місяця');
// else if(day >20 && day <=31)
//     console.log('Третя декада місяця');
// else {
//     console.log('Некоректне число');
// }
// TASK 4- Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).
// let day = +prompt('Введіть день тижня');
// switch (day){
//     case 1:{
//         console.log('Monday');
//         break;
//     }
//     case 2:{
//         console.log('Tuesday');
//         break;
//     }
//     case 3:{
//         console.log('Wednesday');
//         break;
//     }
//     case 4:{
//         console.log('Thursday');
//         break;
//     }
//     case 5:{
//         console.log('Friday');
//         break;
//     }
//     case 6:{
//         console.log('Saturday');
//         break;
//     }
//     case 7:{
//         console.log('Sunday');
//         break;
//     }
//     default:{
//         console.log('Некоректне число');
//     }
// }

//TASK 5 - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//         Також потрібно врахувати коли введені рівні числа.
// let number1 = +prompt('Введіть перше число');
// let number2 = +prompt('Введіть другк число');
// if(number1 === number2){
//     console.log('ЧИСЛА РІВНІ');
// }
// else if (number1 > number2){
//     console.log('ПЕРШЕ ЧИСЛО БІЛЬШЕ');
// }
// else {
//     console.log('ДРУГЕ ЧИСЛО БІЛЬШЕ')
//}
//
// TASK  6    - є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,
//         за допомоги  оператора || буде присвоювати змінній х значення "default"  якщо значення змінної х являється falsy (хибноподыбне, тобто кастується до false)
// let x = prompt('Введіть довільне значення') || "default";

// console.log(x);
